/* //задание №1

var c = +prompt("Задайте температуру в градусах по Цельсию: ");
var f =  (9 / 5) * c + 32;
alert( "Соответствующая температурa в градусах по Фаренгейту: " + f);

//задание №2

var admin, name;
name = "Василий";
admin = name;
alert(admin); 

//задание №4

//1000 + "108"=1000108, так как 1000 - тип number, a 108 - тип string

//доп. задание 

var a = 9;
var b = 120;
alert("\n До обмена значениями: \n a = " + a + "\n b = " + b);
a = a + b;
b = a - b;
a = a - b;
alert("\n После обмена значениями: \n a = " + a + "\n b = " + b);
 */